{
    "title": "Topics in <em>PMLA<\/em>",
    "meta_info": "<h2>A demonstration model of <em>PMLA</em></h2>\n\n<p>This is an example demonstrating my <a href=\"http://agoldst.github.io/dfr-browser\">dfr-browser, a tool for browsing topic models created from JSTOR journals</a>. This demo explores a topic model of articles from the journal <em>PMLA</em>. More specifically, what it shows is the results of allowing <a href=\"http://mallet.cs.umass.edu\">MALLET</a>'s Latent Dirichlet Allocation algorithm to categorize those articles into 64 \"topics\" or patterns of co-occurring words. The resulting model simultaneously gives some information about words that occur together in this corpus, about documents that are related by their shared patterns of language use, and about (approximately) the thematic make-up of the documents. In this browser, I also highlight trends in the proportions of a topic in all the documents in a given year.</p>\n\n<p>The model itself was created as a demo for my <a href=\"http://github.com/agoldst/dfr-analysis\">JSTOR DfR-modeling scripts</a> (the code that generates this model is visible in <a href=\"https://github.com/agoldst/dfr-analysis/tree/master/demo\">dfr-analysis/demo</a>). I downloaded all the available <em>PMLA</em> items from JSTOR's <a href=\"http://dfr.jstor.org\">Data for Research</a> service. I restricted my data set to items categorized as \"full-length articles\" with more than 2000 words (this leaves 5605 articles out of the 9200 items from the years 1889–2007), and I discarded all but the most ten thousand frequent words and a fairly large set of <a href=\"https://github.com/agoldst/dfr-analysis/blob/master/demo/stoplist.txt\">stop words</a>. I used the <a href=\"http://cran.r-project.org/web/packages/mallet/\">R mallet package</a> to run MALLET, estimating a hyperparameter-optimized topic model with 64 topics; having experimented with more and fewer topics, this seemed to produce a reasonable, though far from perfect, broad thematic classification.</p>\n\n<p>I won't add any further interpretive commentary here. For more on interpreting topic models of literary scholarship, see my forthcoming <em>NLH</em> essay with Ted Underwood (<a href=\"http://www.rci.rutgers.edu/~ag978/quiet/preprint.pdf\">preprint</a>). This site has a different aim. Recent discussions about topic modeling in literary and cultural scholarship have made clear to me that it would be useful to allow others to move around and through the topic model themselves, so that they could develop different interpretations, challenge our way of seeing things, and search out ways to improve the possible results. More broadly, this kind of cumulative analytic work with topic models (or with other similarly elaborate \"machine learning\" or automated content analysis and pattern-finding techniques) will only be possible when those who are experts in the subject matter under analysis also feel comfortable assessing the strengths and weaknesses of the modeling technique. That is why I have made this browser, and I hope others will develop it further. If they can <a href=\"http://github.com/agoldst/dfr-browser\">make use of my code</a>, so much the better.</p>",
    "VIS": {
        "bib_sort": {
            "major": "year",
            "minor": "alpha"
        },
        "prefab_plots": false, 
        "model_view": {
            "aspect": 1.333,
            "words": 6,
            "size_range": [6, 14]
        } 
    }
}
